{"data":{"site":{"siteMetadata":{"title":"Stephanie Blog","author":""}},"markdownRemark":{"id":"22270613-0eab-5990-a674-fe47efe14156","excerpt":"Internships.  An opportunity to explore your career options and asses what\nyou love and what you don’t ever want to look at after it’s over…","html":"<p><em>Internships.</em> An opportunity to explore your career options and asses what\nyou love and what you don’t ever want to look at after it’s over.</p>\n<p>This summer I was lucky enough to meet Allison Kunz, founder of Free Agency and my mentor from Rewriting the Code, who bestowed me the opportunity to be an intern for her company which aligned perfectly with my summer schedule—I got to work remotely. The convenience of getting your work done without having to go to be at set location nine-to-five everyday is a way of life I never thought of before. Communication platforms such as Google Hangout have been an imperative part of my internship. Through this channel, I had weekly updates, conducted my user and usability research, and participated in lessons taught by my mentor for the week. In addition to the internship, Allision guided me to obtain a grant from Maryland Tech Connection which allowed me to purchase courses through DataCamp and further develop skills with Git and Python. Through this internship I had the amazing opportunity to rotate through a number of projects with the help of some very talented mentors.</p>\n<h2>Business + Marketing</h2>\n<h3>Mentors:</h3>\n<p>Dianna Berisha &#x26; Allison Kunz</p>\n<h4>Summary</h4>\n<p>My first project was to build a competitive landscape analysis. At first I was overwhelmed; I felt like every little detail was important; every color, image and slogan must be noted. I used Google Sheets to document variables for each freeelance marketplace platform such as pain-points, number of users, subscription prices and features. This analysis in addition to networking at technology events allowed the company to narrow down their niche and focus on a product that can be delivered ASAP.</p>\n<h4>Takeaways</h4>\n<p>Research at first seemed daunting. One weakness I noticed was that it was easy to dig yourself in a hole and get too much information on one company that might not be helpful when comparing all the companies on a greater scale. However from the input, recommendations and business articles Dianna provided, I was able to begin filtering through each platform for essential information. In conclusion, I learned that although landscape analyses may be tedious they are essential to a start-up company because it allows one to see what other companies are doing and how we can make do it better.</p>\n<h2>User Research + UX Design</h2>\n<h3>Mentor:</h3>\n<p>Charles Haitkin</p>\n<h4>Summary</h4>\n<p>This rotation encompassed two aspects of being a UX designer, creation and revision. First, Charles walked me through his first prototype of Free Agency’s login process and submitting a proposal. As we went through the prototype he asked questions that provided information on how much the user understands how to handle the site.</p>\n<h5>Account Page</h5>\n<h4>Takeaways</h4>\n<h2>ReactJS</h2>\n<h3>Mentor:</h3>\n<p>Allison Kunz</p>\n<h4>Summary</h4>\n<h4>Takeaways</h4>","frontmatter":{"title":"Free Agency Internship","date":"October 05, 2018"}}},"pageContext":{"slug":"/blog-1/","previous":null,"next":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"About Me"}}}}